xmlsamples/DAS_Query/PI-CN-GetUSStateList-AIS-CNK88.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <device>
            <id>GRCBXLHK01</id>
            <type>AGENT</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>GRCB</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGHHCNK881T</identifier>
            <reference_no>wu07201911290000</reference_no>
            <counter_id>CNK88ART001A</counter_id>
         </foreign_remote_system>
         <client_id>H2H</client_id>
         <name>GetUSStateList</name>
         <filters>
            <queryfilter1>en</queryfilter1>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>